<template>
  <div id="app">
    <Quiz
            v-bind:questions="this.questions"
            v-bind:results="this.results"
    />
  </div>
</template>

<script>
import Quiz from './components/Quiz.vue'

export default {
  name: 'App',
  data() {
    return {
      questions: [
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "<strong>В Москве!</strong> Коммунальные службы, как всегда, тормозят",
              "feedback": "Не в этот раз! На фото — Нью-Йорк."
            },
            {
              "text": "Судя по снегопаду, где-то в центре <strong>Хельсинки</strong>",
              "feedback": "Хорошая попытка. Но нет, это заметает Нью-Йорк."
            },
            {
              "text": "Улицы зимнего <strong>Нью-Йорка</strong> я всегда узнаю",
              "feedback": "В яблочко!",
              "correct": true
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "additional": "Безопасно ездить по зимним дорогам в городе помогут шины" +
                  " Cordiant <a href=''>Winter Drive 2</a>. Они идеальны, когда на" +
                  " поверхности улиц то снег, то каша, то мокрый лёд." +
                  " Ловите шанс: сейчас эти шины можно купить со скидкой 15%." +
                  " Ищите промокод в конце теста.",
          "answers": [
            {
              "text": "Это же Русский мост во <strong>Владивостоке</strong>!",
              "feedback": "Дело говорите! Он и есть.",
              "correct": true
            },
            {
              "text": "Знаю, это мост-переезд между <strong>Данией и Швецией</strong>",
              "feedback": "Эх, не признали Владивосток!"
            },
            {
              "text": "Это мост через Иртыш в городе Семей. Фото сделано в <strong>Казахстане</strong>!",
              "feedback": "Похоже! Но нет — это Владивосток."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "additional": "Чтобы маневрировать по снежным заносам за городом," +
                  " выбирайте резину Cordiant <a href=''>Snow Cross</a>." +
                  " Эти шины легко выедут из утрамбованной" +
                  " колеи и подарят вам ощущение полного контроля.",
          "answers": [
            {
              "text": "Типичная <strong>Сибирь</strong>. Дорога где-нибудь в Алтайском крае",
              "feedback": "Было сложно, но вы угадали!",
              "correct": true
            },
            {
              "text": "Это <strong>итальянские Апеннины</strong> зимой",
              "feedback": "Далеко! На фото — Алтай."
            },
            {
              "text": "Так выглядит ландшафт Аляски. Мой ответ — <strong>США</strong>",
              "feedback": "Эх, не угадали. Это Алтай."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "В <strong>Карачаево-Черкесии</strong>! Это точно зимний Домбай ",
              "feedback": "Домбай чудесен, но это Австрия.",
            },
            {
              "text": "Кажется, это панорамная дорога Гросглоккнер в <strong>Австрии</strong>",
              "feedback": "Вы угадали.",
              "correct": true
            },
            {
              "text": "В <strong>швейцарских Альпах</strong>! Это дорога из Сент-Морица в Базель",
              "feedback": "Там тоже красиво, но это Австрия."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "additional": "Чтобы чувствовать себя уверенно даже на голом льду," +
                  " используйте шины Cordiant <a href=''>Snow Cross 2</a>." +
                  " Благодаря COR-технологиям шипы проникают" +
                  " глубоко в лёд и увеличивают сцепление на 10%," +
                  " а динамику разгона — на 20%!",
          "answers": [
            {
              "text": "В Стране Великих озёр — <strong>Канаде</strong>. Фото явно сделано на водах Гурона",
              "feedback": "Мимо! Это воды Байкала.",
            },
            {
              "text": "Сердцем чувствую, что это <strong>Байкал</strong>",
              "feedback": "Браво! Интуиция вас не подвела.",
              "correct": true
            },
            {
              "text": "Нордический пейзаж подсказывает, что это река Гломма в <strong>Норвегии</strong>",
              "feedback": "Промахнулись, это в России."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "Да что дорога! Такое небо только в <strong>Исландии</strong>",
              "feedback": "И добавить нечего! Да!",
              "correct": true
            },
            {
              "text": "Это пустырь на окраинах <strong>Костромы</strong>… Романтика!",
              "feedback": "Романтика, но, увы, исландская.",
            },
            {
              "text": "Асфальт что надо! Это <strong>Германия</strong>, перед съездом на автобан",
              "feedback": "Да, он хорош! Но сделан в Исландии."
            }
          ]
        },
      ],
      results: {
        "3": {
          "title": "Я — географ-экстрасенс",
          "text": "Узнать российские дороги? Несите задачку посложнее! " +
                  "Если нужно, я вам по фото и географические координаты назову."
        },
        "2": {
          "title": "Я — начинающий топограф",
          "text": "Узнаю российские дороги без регистрации и СМС." +
                  " Но иногда всё же путаюсь — эти зимние трассы так похожи."
        },
        "1": {
          "title": "Я — дорожный романтик",
          "text": "Да кто вообще смотрит под ноги!" +
                  " Я считаю звёзды и ловлю снежинки, а не изучаю асфальт." +
                  " Ой, смотрите: облако похоже на слоника!"
        }
      }
    }
  },
  components: {
    Quiz
  }
}
</script>
