<template>
  <div id="app">
    <Quiz v-bind:questions="this.questions"/>
  </div>
</template>

<script>
import Quiz from './components/Quiz.vue'

export default {
  name: 'App',
  data() {
    return {
      questions: [
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "В Москве! Коммунальные службы, как всегда, тормозят",
              "feedback": "Не в этот раз! На фото — Нью-Йорк."
            },
            {
              "text": "Судя по снегопаду, где-то в центре Хельсинки",
              "feedback": "Хорошая попытка. Но нет, это заметает Нью-Йорк."
            },
            {
              "text": "Улицы зимнего Нью-Йорка я всегда узнаю",
              "feedback": "В яблочко!",
              "correct": true
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "Это же Русский мост во Владивостоке!",
              "feedback": "Дело говорите! Он и есть.",
              "correct": true
            },
            {
              "text": "Знаю, это мост-переезд между Данией и Швецией",
              "feedback": "Эх, не признали Владивосток!"
            },
            {
              "text": "Это мост через Иртыш в городе Семей. Фото сделано в Казахстане!",
              "feedback": "Похоже! Но нет — это Владивосток."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "Типичная Сибирь. Дорога где-нибудь в Алтайском крае",
              "feedback": "Было сложно, но вы угадали!",
              "correct": true
            },
            {
              "text": "Это итальянские Апеннины зимой",
              "feedback": "Далеко! На фото — Алтай."
            },
            {
              "text": "Так выглядит ландшафт Аляски. Мой ответ — США",
              "feedback": "Эх, не угадали. Это Алтай."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "В Карачаево-Черкесии! Это точно зимний Домбай ",
              "feedback": "Домбай чудесен, но это Австрия.",
            },
            {
              "text": "Кажется, это панорамная дорога Гросглоккнер в Австрии",
              "feedback": "Вы угадали.",
              "correct": true
            },
            {
              "text": "В швейцарских Альпах! Это дорога из Сент-Морица в Базель",
              "feedback": "Там тоже красиво, но это Австрия."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "В Стране Великих озёр — Канаде. Фото явно сделано на водах Гурона",
              "feedback": "Мимо! Это воды Байкала.",
            },
            {
              "text": "Сердцем чувствую, что это Байкал",
              "feedback": "Браво! Интуиция вас не подвела.",
              "correct": true
            },
            {
              "text": "Нордический пейзаж подсказывает, что это река Гломма в Норвегии",
              "feedback": "Промахнулись, это в России."
            }
          ]
        },
        {
          "text": "Где эта дорога?",
          "answers": [
            {
              "text": "Да что дорога! Такое небо только в Исландии",
              "feedback": "И добавить нечего! Да!",
              "correct": true
            },
            {
              "text": "Это пустырь на окраинах Костромы… Романтика!",
              "feedback": "Романтика, но, увы, исландская.",
            },
            {
              "text": "Асфальт что надо! Это Германия, перед съездом на автобан",
              "feedback": "Да, он хорош! Но сделан в Исландии."
            }
          ]
        },
      ]
    }
  },
  components: {
    Quiz
  }
}
</script>
